/*==========================================================================
 * ÃèÊö    £ºÁèÏö·É¿Ø×´Ì¬´¦Àí£¨Ö÷ÒªÊÇÒ¡¸Ë½âËø£¬´¥·¢Ð£×¼µÈ£©
 * ¸üÐÂÊ±¼ä£º2020-03-31 
 * ×÷Õß		 £ºÄäÃû¿Æ´´-Jyoun
 * ¹ÙÍø    £ºwww.anotc.com
 * ÌÔ±¦    £ºanotc.taobao.com
 * ¼¼ÊõQÈº £º190169595
 * ÏîÄ¿ºÏ×÷£º18084888982£¬18061373080
============================================================================
 * ÄäÃû¿Æ´´ÍÅ¶Ó¸ÐÐ»´ó¼ÒµÄÖ§³Ö£¬»¶Ó­´ó¼Ò½øÈº»¥Ïà½»Á÷¡¢ÌÖÂÛ¡¢Ñ§Ï°¡£
 * ÈôÄú¾õµÃÄäÃûÓÐ²»ºÃµÄµØ·½£¬»¶Ó­ÄúÅÄ×©ÌáÒâ¼û¡£
 * ÈôÄú¾õµÃÄäÃûºÃ£¬Çë¶à¶à°ïÎÒÃÇÍÆ¼ö£¬Ö§³ÖÎÒÃÇ¡£
 * ÄäÃû¿ªÔ´³ÌÐò´úÂë»¶Ó­ÄúµÄÒýÓÃ¡¢ÑÓÉìºÍÍØÕ¹£¬²»¹ýÔÚÏ£ÍûÄúÔÚÊ¹ÓÃÊ±ÄÜ×¢Ã÷³ö´¦¡£
 * ¾ý×ÓÌ¹µ´µ´£¬Ð¡ÈË³£ÆÝÆÝ£¬ÄäÃû¼á¾ö²»»áÇëË®¾
 ü¡¢ÇëÅç×Ó£¬Ò²´ÓÎ´ÓÐ¹ýÄ¨ºÚÍ¬ÐÐµÄÐÐÎª¡£  
 * ¿ªÔ´²»Ò×£¬Éú»î¸ü²»ÈÝÒ×£¬Ï£Íû´ó¼Ò»¥Ïà×ðÖØ¡¢»¥°ï»¥Öú£¬¹²Í¬½ø²½¡£
 * Ö»ÓÐÄúµÄÖ§³Ö£¬ÄäÃû²ÅÄÜ×öµÃ¸üºÃ¡£  
===========================================================================*/
#include "LX_FC_State.h"
#include "ANO_DT_LX.h"




static void LX_Unlock_Lock_Check(float *dT_s)
{
	
}

void LX_Cali_Trig_Check()
{

}

void LX_FC_State_Task(float dT_s)
{
		LX_Unlock_Lock_Check(&dT_s);
		//
		LX_Cali_Trig_Check();
}
